sub-projects/intelitor-v5.2/scripts/performance/artillery-baseline-config.yml
# Artillery Baseline Testing Configuration
# Purpose: Establish performance baselines for comparison
# Duration: ~10 minutes
# STAMP Compliance: SC-PRF-049

config:
  target: '{{ $processEnvironment.ARTILLERY_TARGET || "http://localhost:4000" }}'

  plugins:
    expect: {}
    metrics-by-endpoint: {}

  phases:
    # Phase 1: Light warm-up (2 minutes)
    - duration: 120
      arrivalRate: 5
      name: "Baseline Warm-up"

    # Phase 2: Light load (2 minutes)
    - duration: 120
      arrivalRate: 10
      name: "Baseline Light Load"

    # Phase 3: Moderate load (3 minutes)
    - duration: 180
      arrivalRate: 25
      name: "Baseline Moderate Load"

    # Phase 4: Standard load (3 minutes)
    - duration: 180
      arrivalRate: 50
      name: "Baseline Standard Load"

    # Phase 5: Cooldown (1 minute)
    - duration: 60
      arrivalRate: 10
      name: "Baseline Cooldown"

  processor: "./artillery-processor.js"

  defaults:
    headers:
      Content-Type: "application/json"
      Accept: "application/json"
      Authorization: 'Bearer {{ $processEnvironment.ARTILLERY_AUTH_TOKEN || "baseline-test-token" }}'

  # Strict baseline thresholds for comparison
  ensure:
    - p50: 50      # 50th percentile under 50ms
    - p95: 200     # 95th percentile under 200ms
    - p99: 500     # 99th percentile under 500ms
    - median: 30   # Median under 30ms

scenarios:
  # Health endpoint (baseline reference)
  - name: "Baseline Health"
    weight: 20
    flow:
      - get:
          url: "/api/health"
          expect:
            - statusCode: 200

  # Core read operations
  - name: "Baseline Alarm Read"
    weight: 30
    flow:
      - get:
          url: "/api/v1/alarms"
          expect:
            - statusCode: 200
      - think: 2
      - get:
          url: "/api/v1/alarms/active"
          expect:
            - statusCode: 200

  # Device operations
  - name: "Baseline Device Read"
    weight: 25
    flow:
      - get:
          url: "/api/v1/devices"
          expect:
            - statusCode: 200
      - think: 2
      - get:
          url: "/api/v1/sites"
          expect:
            - statusCode: 200

  # Analytics operations
  - name: "Baseline Analytics"
    weight: 25
    flow:
      - get:
          url: "/api/v1/dashboard/statistics"
          expect:
            - statusCode: 200
      - think: 3
      - get:
          url: "/api/v1/analytics/devices/health"
          expect:
            - statusCode: 200