sub-projects/intelitor-v5.2/scripts/performance/artillery-stress-config.yml
# Artillery Stress Testing Configuration
# Purpose: Validate system performance under extreme load conditions
# Target: 450 RPS (Requests Per Second) - C1.2 Performance Goal
# Duration: ~20 minutes
# STAMP Compliance: SC-PRF-049, SC-PRF-050, SC-PRF-051

config:
  target: '{{ $processEnvironment.ARTILLERY_TARGET || "http://localhost:4000" }}'

  # Output configuration for metrics analysis
  plugins:
    expect: {}
    metrics-by-endpoint: {}

  phases:
    # Phase 1: Warm-up (2 minutes)
    # Gradually warm up the system and establish baseline
    - duration: 120
      arrivalRate: 20
      name: "Stress Warm-up"

    # Phase 2: Ramp to baseline (3 minutes)
    # Increase to 100 RPS baseline
    - duration: 180
      arrivalRate: 20
      rampTo: 100
      name: "Ramp to Baseline"

    # Phase 3: Ramp to moderate stress (3 minutes)
    # Increase to 250 RPS
    - duration: 180
      arrivalRate: 100
      rampTo: 250
      name: "Ramp to Moderate Stress"

    # Phase 4: Ramp to high stress (3 minutes)
    # Increase to 350 RPS
    - duration: 180
      arrivalRate: 250
      rampTo: 350
      name: "Ramp to High Stress"

    # Phase 5: Ramp to target (2 minutes)
    # Reach 450 RPS target
    - duration: 120
      arrivalRate: 350
      rampTo: 450
      name: "Ramp to Target 450 RPS"

    # Phase 6: Sustained peak load (5 minutes)
    # Hold at 450 RPS to validate sustained performance
    - duration: 300
      arrivalRate: 450
      name: "Peak Load: 450 RPS"

    # Phase 7: Recovery monitoring (2 minutes)
    # Monitor system recovery under reduced load
    - duration: 120
      arrivalRate: 450
      rampTo: 50
      name: "Recovery Ramp-down"

    # Phase 8: Cooldown (1 minute)
    - duration: 60
      arrivalRate: 10
      name: "Stress Cooldown"

  processor: "./artillery-processor.js"

  defaults:
    headers:
      Content-Type: "application/json"
      Accept: "application/json"
      Authorization: 'Bearer {{ $processEnvironment.ARTILLERY_AUTH_TOKEN || "stress-test-token" }}'
      X-Request-ID: "stress-{{ $uuid }}"

  # Stress test thresholds - stricter than spike but looser than CI
  ensure:
    # Latency requirements at 450 RPS
    - p50: 100     # 50th percentile under 100ms
    - p95: 500     # 95th percentile under 500ms
    - p99: 1000    # 99th percentile under 1s
    - max: 5000    # Maximum under 5s
    # Success rate requirements
    - http.codes.200: 98  # At least 98% success rate at peak
    - http.codes.5xx: 1   # Less than 1% server errors

  # Reporting configuration
  # Run with: artillery run --output stress-report.json artillery-stress-config.yml
  # Convert to HTML: artillery report stress-report.json

scenarios:
  # Health check endpoint (10% - fast, lightweight)
  - name: "Stress Health Check"
    weight: 10
    flow:
      - get:
          url: "/api/health"
          expect:
            - statusCode: 200
            - contentType: application/json

  # Core alarm endpoints (40% - primary business flow)
  - name: "Stress Alarm Operations"
    weight: 40
    flow:
      # List alarms with pagination
      - get:
          url: "/api/v1/alarms"
          qs:
            page: "{{ $randomInt(1, 10) }}"
            limit: 20
          expect:
            - statusCode: 200
      # Get active alarms
      - get:
          url: "/api/v1/alarms/active"
          expect:
            - statusCode: 200

  # Device management (20% - secondary business flow)
  - name: "Stress Device Operations"
    weight: 20
    flow:
      - get:
          url: "/api/v1/devices"
          qs:
            page: "{{ $randomInt(1, 5) }}"
            limit: 50
          expect:
            - statusCode: 200
      - think: 1
      - get:
          url: "/api/v1/sites"
          expect:
            - statusCode: 200

  # Dashboard and analytics (20% - resource-intensive)
  - name: "Stress Dashboard Analytics"
    weight: 20
    flow:
      - get:
          url: "/api/v1/dashboard/statistics"
          expect:
            - statusCode: 200
      - get:
          url: "/api/v1/analytics/alarms/by-severity"
          qs:
            timeframe: "24h"
          expect:
            - statusCode: 200
      - think: 2
      - get:
          url: "/api/v1/analytics/devices/health"
          expect:
            - statusCode: 200

  # Write operations (10% - create/update flows)
  - name: "Stress Write Operations"
    weight: 10
    flow:
      - function: "randomEventType"
      - function: "randomSeverity"
      - function: "randomDeviceId"
      - function: "randomSiteId"
      - post:
          url: "/api/v1/alarms"
          json:
            event_code: "STRESS_{{ $randomString() }}_{{ $timestamp }}"
            event_type: "{{ eventType }}"
            severity: "{{ severity }}"
            description: "Stress test alarm"
            device_id: "{{ deviceId }}"
            site_id: "{{ siteId }}"
            metadata:
              stress_test: true
              test_run: "{{ $timestamp }}"
          capture:
            - json: "$.id"
              as: "alarmId"
          expect:
            - statusCode: 201
      - think: 1
      - function: "randomUserId"
      - patch:
          url: "/api/v1/alarms/{{ alarmId }}/acknowledge"
          json:
            acknowledged_by: "{{ userId }}"
            notes: "Stress test acknowledgment"
          expect:
            - statusCode: 200